// Tyuiu.AramaAG.Sprint1.Task0.V2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include "..//Tyuiu.AramaAG.Sprint1.Task0.V2.Lib/Tyuiu.AramaAG.Sprint1.Task0.V2.Lib.cpp"
using namespace std;
int main()
{
    setlocale(LC_ALL, "rus");
    ISprint1Task0V01* service = new Service();
    int l, w, h;
    cout << "Введите длину параллелепипеда:   ";
    cin >> l;
    cout << "Введите ширину параллелепипеда:   ";
    cin >> w;
    cout << "Введите высоту параллелепипеда:   ";
    cin >> h;
    int rezult = service->Rezalt(l, w, h);
    cout << "Площадь боковой поверхности параллелепипеда = " << rezult;

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
